Autodesk.Revit.DB.RepeaterCoordinates.GetCoordinate(System.Int32)
Returns the coordinate in the given dimension.
Remarks:
The dimension begins at 0 and must be in the range [0, number of dimensions in the bounds - 1].
This method does not apply to zero dimensional coordinates.
dimension:
The dimension.
Returns:
The coordinate.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The dimension is invalid for these coordinates.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The coordinates must have at least one dimension.
Since:
2014

Autodesk.Revit.DB.RepeaterCoordinates.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.RepeaterCoordinates.DimensionCount
The number of dimensions of the coordinates (0, 1 or 2 for zero, one or two dimensional arrays.)
Since:
2014

Autodesk.Revit.DB.RepeaterCoordinates.#ctor(System.Int32,System.Int32)
Creates two dimensional coordinates.
x:
The coordinate in first dimension.
y:
The coordinate in second dimension.
Since:
2014

Autodesk.Revit.DB.RepeaterCoordinates.#ctor(System.Int32)
Creates one dimensional coordinates.
x:
The coordinate.
Since:
2014

Autodesk.Revit.DB.RepeaterCoordinates.#ctor
Creates zero dimensional coordinates.
Since:
2014

Autodesk.Revit.DB.RepeaterCoordinates
Represents coordinates in the array of repeating references in 0, 1, or 2 dimensions.
Since:
2014